In [1]:
%load tutorial.db [rw]

In [6]:
Create table If Not Exists Employees (id int, name varchar(20))

In [8]:
Create table If Not Exists EmployeeUNI (id int, unique_id int)

In [10]:
insert into Employees (id, name) values ('1', 'Alice')

In [11]:
insert into Employees (id, name) values ('7', 'Bob')

In [12]:
insert into Employees (id, name) values ('11', 'Meir')

In [13]:
insert into Employees (id, name) values ('90', 'Winston')

In [14]:
insert into Employees (id, name) values ('3', 'Jonathan')

In [15]:
insert into EmployeeUNI (id, unique_id) values ('3', '1')

In [16]:
insert into EmployeeUNI (id, unique_id) values ('11', '2')

In [17]:
insert into EmployeeUNI (id, unique_id) values ('90', '3')

In [18]:
select * from Employees

+----+----------+
| id | name     |
+----+----------+
| 1  | Alice    |
+----+----------+
| 7  | Bob      |
+----+----------+
| 11 | Meir     |
+----+----------+
| 90 | Winston  |
+----+----------+
| 3  | Jonathan |
+----+----------+

In [19]:
select * from EmployeeUNI

+----+-----------+
| id | unique_id |
+----+-----------+
| 3  | 1         |
+----+-----------+
| 11 | 2         |
+----+-----------+
| 90 | 3         |
+----+-----------+

## Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

Return the result table in any order.

In [38]:
select U.unique_id, E.name
from Employees E left join EmployeeUNI U
using (id)

+-----------+----------+
| unique_id | name     |
+-----------+----------+
|           | Alice    |
+-----------+----------+
|           | Bob      |
+-----------+----------+
| 2         | Meir     |
+-----------+----------+
| 3         | Winston  |
+-----------+----------+
| 1         | Jonathan |
+-----------+----------+